## NBA Dataset 
#### Pandas practise series from GFG

In [1]:
import pandas as pd

#### Using List

In [2]:
lst = ['Joy', 'is', 'a', 'python', 'programmer']

In [3]:
df = pd.DataFrame(lst)

In [4]:
df

            0
0         Joy
1          is
2           a
3      python
4  programmer

#### Using Dictionary

In [6]:
data = {'Name': ['Joy', 'John', 'Jane', 'Joe'],
        'Age' : [30, 27, 25, 20]}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

   Name  Age
0   Joy   30
1  John   27
2  Jane   25
3   Joe   20

In [9]:
data['Skills'] = ['Python','Java', 'JS', 'SQL']

In [10]:
data

{'Name': ['Joy', 'John', 'Jane', 'Joe'],
 'Age': [30, 27, 25, 20],
 'Skills': ['Python', 'Java', 'JS', 'SQL']}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

   Name  Age  Skills
0   Joy   30  Python
1  John   27    Java
2  Jane   25      JS
3   Joe   20     SQL

In [13]:
df[['Name', 'Skills']]

   Name  Skills
0   Joy  Python
1  John    Java
2  Jane      JS
3   Joe     SQL

### Now, we'll be using 'nba.csv' file for below examples

In [15]:
import pandas as pd

In [16]:
data = pd.read_csv("nba.csv", index_col ="Name")

In [19]:
data

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### >> retrieving row by loc method <<

In [20]:
first = data.loc['Avery Bradley']

In [23]:
second = data.loc['Jae Crowder']

In [22]:
print(first,"\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  99
Position                SF
Age                     25
Height                 6-6
Weight                 235
College          Marquette
Salary         6.79612e+06
Name: Jae Crowder, dtype: object

In [40]:
# "Indexing and Selecting Data" 
## Selecting a single columns

In [27]:
import pandas as pd

In [28]:
data = pd.read_csv("nba.csv", index_col ="Name")

In [29]:
first = data['Age']

In [31]:
print(first)

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

In [32]:
## Selecting a single row

In [33]:
# retrieving row by loc method

first = data.loc["John Holland"]
second = data.loc["R.J. Hunter"]

In [34]:
print(first, "\n\n\n", second)

Team           Boston Celtics
Number                     30
Position                   SG
Age                        27
Height                    6-5
Weight                    205
College     Boston University
Salary                    NaN
Name: John Holland, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

### Indexing a DataFrame using .iloc[ ] :
        This function allows us to retrieve rows and columns by position. In order to do that, we’ll need to specify the positions of the rows that we want, and the positions of the columns that we want as well. The df.iloc indexer is very similar to df.loc but only uses integer locations to make its selections.

In [35]:
import pandas as pd

In [36]:
# making data frame from csv file
data = pd.read_csv("nba.csv", index_col ="Name")

In [39]:
data

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [37]:
# retrieving rows by iloc method 
row2 = data.iloc[3]

In [38]:
print(row2)

Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

In [ ]:
# Continue from "Working with Missing Data"

## Checking for missing values using isnull() and notnull() :


https://www.geeksforgeeks.org/python-pandas-dataframe/